#+TITLE: BBMP: BB@@html:<span style="color: gray">@@engaluru @@html:</span>@@M@@html:<span style="color: gray">@@athematics Club@@html:</span>@@P
#+TODO: UPCOMING | DONE
#+OPTIONS: toc:nil p:t prop:t

#+HTML_HEAD: <link rel="stylesheet" href="https://edwardtufte.github.io/tufte-css/tufte.css">

#+begin_export html
<style>
  body {
    padding-left: 0 !important;
  }
  pre {
    background-color: unset !important;
  }
</style>
#+end_export

Welcome to the home page of BBMP, a Bengaluru based Mathematics Club focused on
the pleasure of understanding. This website is to keep resources and meeting
archives. You can subscribe to the event calendar [[https://bbmp.club/cal.ics][here]].

To contribute, add content, or suggest changes, please submit PRs [[https://github.com/lepisma/bbmp/blob/main/index.org][here]]. The file
is an Org Mode file that gets converted to this HTML.

Since we don't have a group email ID, to contact us please write to
[[https://lepisma.xyz/wiki/about/contact.html][Abhinav]]. Find more Mathematics groups in Bengaluru [[https://lepisma.xyz/wiki/mathematics/#sec-clubs][here]]!

#+begin_src emacs-lisp :exports none
  ;; Run this code block to perform export and additional side acts
  ;; Run this to export dates as a calendar file
  (customize-set-variable 'org-icalendar-use-deadline '(event-if-not-todo event-if-todo todo-due))
  (customize-set-variable 'org-icalendar-use-scheduled '(event-if-not-todo event-if-todo todo-start))
  (org-icalendar-export-to-ics)

  (rename-file "index.ics" "cal.ics" t)

  ;; Next we export the HTML
  (defun org-export-bbmp-title-fix (string backend _chan)
    (when (equal 'html backend)
      (string-replace "<title>BBMP: BB@@html:&lt;span style=\"color: gray\"&gt;@@engaluru @@html:&lt;/span&gt;@@M@@html:&lt;span style=\"color: gray\"&gt;@@athematics Club@@html:&lt;/span&gt;@@P</title>"
                      "<title>BBMP: BBengaluru Mathematics ClubP</title>"
                      string)))

  (let ((org-export-filter-final-output-functions (list #'org-export-bbmp-title-fix)))
    (org-html-export-to-html))
#+end_src

#+RESULTS:
: index.html

